<template>
<div>
    <p align = center> <font size = 5> <i> Коди Абрамсона. Короткі теоретичні відомості. </i> </font>  </p>
<p align = center> <font size = 4> <b> Кодування. </b> </font> </p>
<p>&nbsp;&nbsp;&nbsp; Циклічні коди відносяться до числа блокових систематичних кодів, в яких кожна комбінація кодується самостійно (у вигляді блоку) таким чином, що інформаційні (k) і контрольні (m) символи завжди знаходяться на певних місцях. В основу циклічного кодування покладено використання неприводимого многочлена
P (x), який стосовно циклічним кодами називається утворюючим многочленом (поліномом). В якості інформаційних символів для побудови циклічних кодів беруться комбінації двійкового коду на всі сполучення. Циклічний код або закодоване повідомлення
F (x) можна утворити двома способами: </p>
<ol>
  <li> Множенням однієї з комбінацій двійкового коду на всі сполучення (комбінація
    Q (x)), що належить до тієї ж групи того ж коду, що і задана (комбінація
    G (x)), на який утворює многочлен P (x); </li>
  <li> Множенням заданої кодової комбінації
    G (x) на одночлен x <sup> m </sup>, що має ту ж ступінь, що і утворить многочлен
    P (x), з додаванням до цього твору залишку від ділення твори
    x <sup> m </sup> <sup> </sup> · G (x) на який утворює многочлен
    P (x). Таким чином, F (x) = Q (x) · P (x) = (x <sup> m </sup>) ·
    G (x) + R (x). 
    </li>
</ol>
<p> &nbsp; &nbsp; &nbsp; Коди Абрамсона відносяться до групи циклічних кодів, що дозволяють виявляти і виправляти поодинокі пачки помилок. Отже, процедура кодування для кодів Абрамсона аналогічна стандартною процедурою кодування циклічних кодів. Довжина кодової комбінації кодів Абрамсона n = 2 <sup> h </sup> - 1, &nbsp; де h
- ступінь неприводимого поліном P <sub> 1 </sub> (x) .Образующій поліном
P (x) = (1 + x) · P <sub> 1 </sub> (x). Число інформаційних символів k = 2 <sup> h </sup> - h - 2. Ці вирази справедливі для мінімального кодового відстані
d <sub> min </sub> = 4, що дозволяє коригувати все поодинокі і всі суміжні подвійні помилки. </p>
<p> <b> Приклад кодування </b> </p>
<p> Необхідно закодувати повідомлення 0110010110. </P>
<p> Дан не приводиться поліном P <sub> 1 </sub> = 10011, тобто P <sub> 1 </sub> (x)
= X <sup> 4 </sup> + x + 1. Утворюючий поліном в цьому
випадку буде дорівнює &nbsp; P (x) = (1 + x) · (x <sup> 4 </sup> + x +
1) = x <sup> 5 </sup> + x <sup> 4 </sup> + x <sup> 2 </sup> + 1. </P>
<p> Необхідно знайти залишок від ділення G (x) · x <sup> 5 </sup>
на який утворює поліном x <sup> 5 </sup> + x <sup> 4 </sup> + x <sup> 2 </sup>
+ 1: </p>
<p> <font face = "Courier New"> 0 1 1 0 0 1 0 1 1 0 0 0 0 0 0 | 1 1 0 1 0 1 <br>
&nbsp; 1 1 0 1 0
1 &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
------------- <br>
&nbsp; ----------- <br>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 1 + 1 1 1 1 0 <br>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 1 1 0 1 0 1 <br>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; ----------- <br>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 1 0 1 1 0 0 <br>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 1 1 0 1 0 1 <br>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; ----------- <br>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 1
1 0 0 1 0 <br>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 1
1 0 1 0 1 <br>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
----------- <br>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
1 1 1 0 0 <br>
</font> Таким чином, закодоване
повідомлення F (x) = (x <sup> m </sup>) · G (x) + R (x) = 0110010110 <i> 11100 </i>.
Курсивом виділено перевірочна частина. </P>
<p align = center> <font size = 4> <b> Декодування. </B> </font> </p>
<p> &nbsp; &nbsp; &nbsp; Ідея виявлення помилок в прийнятому циклічному коді полягає в тому, що при відсутності помилок закодована комбінація
F (x) ділиться на який утворює многочлен P (x) без залишку. В цьому випадку контрольні символи відкидаються, а інформаційні символи використовуються за призначенням. Якщо відбулося спотворення прийнятої кодової комбінації, то ця комбінація
F (x) перетворюється в комбінацію H (x), яку можна уявити як суму двох многочленів:
H (x) = F (x) + E (x), де E (x) - многочлен помилок, що містить стільки одиниць, скільки елементів прийнятої комбінації не збігається з елементами в переданої комбінації. Декодування циклічних кодів можна здійснювати наступним чином: </p>
<ol>
  <Li> Обчислити залишок (синдром) R (x). Якщо R (x) = 0, то комбінація прийнята без помилок. Наявність залишку говорить про те, що комбінація прийнята перекрученою. </Li>
  <Li> Підрахувати вага залишку W. Якщо W &lt; = s (s - число виправляє помилок), то прийняту комбінацію складають по модулю 2 із залишком і отримують виправлену комбінацію. </Li>
  <Li> Якщо W> s, то проводиться циклічний зсув на один символ вліво і отримана після такого зсуву комбінація знову ділиться на твірний многочлен.</Li>
</ol>
  <div class="footer-btn">
    <md-button class="md-raised md-primary">
    <p>Пройти Тест</p>
  </md-button>
    <md-button class="md-big md-raised md-primary" href="/">
    <p>На головну</p>
  </md-button>
  </div>
</div>
</template>

<style lang="scss" scoped>
  .footer-btn {
    text-align: center;
  }
  .md-button {
    background-color: aqua;
    color: black;
  }
  .md-content {
    width: 200px;
    height: 200px;
    display: inline-flex;
    justify-content: center;
    align-items: center;
  }
</style>